const smsData = [
  { id: 'sms1', sender: '+82 92047583', date: '10月22日', content: `您好，这里是GS25新堂店。
您订购的商品刚刚已配送完成。商品已安全放置在您指定的位置，请确认。冷藏、冷冻商品收到后请立即妥善保存。
如有疑问，请联系92047583。谢谢。` },
  { id: 'sms2', sender: '+82 48392716', date: '10月10日', content: `您好，顾客，这里是炭烤烤肉小馆（弘大店）。
您点的餐品刚刚已配送完成。请趁热享用，祝您度过愉快的一天。
如果对我们的餐品满意，麻烦留下简短评价。如有任何疑问，请及时联系门店。谢谢。` },
  { id: 'sms3', sender: '+82 17630594', date: '9月28日', content: '您好~这里是山景定食餐厅（圣水店）。餐品已配送完成。请趁热享用，祝您度过愉快的一天。如有任何疑问，请及时联系门店。谢谢~' },
  { id: 'sms4', sender: '+82 63820147', date: '9月25日', content: `您好，这里是GS25乙支路店。
您订购的商品刚刚已配送完成。商品已安全放置在您指定的位置，请确认。冷藏、冷冻商品收到后请立即妥善保存。
如有疑问，请联系63820147。谢谢。` },
  { id: 'sms5', sender: '+82 31586279', date: '8月18日', content: '您好~这里是南山松膳（南山店）。餐品已配送完成。请趁热享用，祝您度过愉快的一天。如有任何疑问，请及时联系门店。谢谢~' },
  { id: 'sms6', sender: '+82 3394279', date: '8月12日', content: `“国民所有人的梦想，KB来一起守护。”
从第一份工资，到第一个1亿韩元——KB青年跃进账户，陪你走完这段最需要耐心的路。
每月最多存入70万韩元，5年到期。基本年利率4.5%起，加上优待利率最高可达年6.0%。
再加上政府贡献金和免税优惠，到期实际收益效果最高可做到年9.54%的水平。
更多详细信息，请咨询当地KB银行网点。` }
];
