const notesData = [
  {
    id: 'note-song-1', date: '2026年1月24日', dateKey: '2026-01-24', title: '青春修炼手册', audioSrc: './备忘录/备忘录歌曲1.mp3',
    content: `跟着我 左手
右手 一个慢动作
右手 左手 慢动作重播
这首歌 给你快乐
你有没有爱上我
跟着我 鼻子
眼睛 动一动耳朵
装乖 耍帅 换不停风格
青春有太多
未知的猜测
成长的烦恼算什么
皮鞋擦亮 换上西装
佩戴上一克拉的梦想
我的勇敢充满电量
昂首到达每一个地方
这世界 的太阳
因为自信才能把我照亮
这舞台 的中央
有我才闪亮
有我才能发着光
跟着我 左手 右手
一个慢动作
右手 左手慢动作重播
这首歌 给你快乐
你有没有爱上我
跟着我 鼻子眼睛
动一动耳朵
装乖 耍帅 换不停风格
青春有太多 未知的猜测
成长的烦恼算什么
经常会想 长大多好
有些事情却只能想象
想说就说 想做就做
为了明天的自己鼓掌
这世界 的太阳
因为自信才能把我照亮
这舞台 的中央
有我才闪亮
有我才能发着光
跟着我左手右手
一个慢动作
右手 左手 慢动作重播
这首歌 给你快乐
你有没有爱上我
跟着我 鼻子 眼睛
动一动耳朵
装乖 耍帅 换不停风格
青春有太多 未知的猜测
成长的烦恼算什么
向明天 对不起
向前冲 不客气
一路有你 充满斗志无限动力
男子汉 没有什么输不起
正太修炼成功的秘籍
跟着我 左手 右手
一个慢动作
右手 左手慢动作重播
这首歌 给你快乐
你有没有爱上我
跟着我 鼻子眼睛
动一动耳朵
装乖 耍帅 换不停风格
青春有太多 未知的猜测
成长的烦恼算什么
成长的烦恼算什么
成长的烦恼算什么`
  },
  {
    id: 'note-song-2', date: '2026年1月25日', dateKey: '2026-01-25', title: 'hey! hey!（中文版）', audioSrc: './备忘录/备忘录歌曲2.mp3',
    content: `伫立在悸动宛如
心跳的大地
敞开我们之间未满的空隙
(敞开我们之间未满的空隙)
来自不同时空坐标系
我们会聚在一起
向那无人知晓的明天
不知不觉地大步狂奔而去

(We don't stop) 守护我热爱的初心
(We don't stop) 捏碎了放弃 running
(We don't stop) 同等温度的 passion
(We don't stop) We don't know how to stop, yeah (We can do it all day)
(We don't stop) 曾形单影只的我
(We don't stop) 爱上了以"我们"为名
(We don't stop) 我的身边是你
(We don't stop) 一起奔跑不息

Hey, hey
全力以赴用心 pass, hey
和我一起奔跑的你是否心潮涌起？
请给我答案当这一曲唱毕
Hey, hey
手掌温热扣在一起
万千情思奔涌填满我隐秘的心底
遇见你是我一生的幸运

我们的别名叫做 vision
光芒胜过太阳 our future
一人独行没有意义
不论何时有我陪你
在同样的时空际遇
梦一定能触及
我要站上世界的峰顶 (峰顶)
大声喊出我们的滚烫愿景

(We don't stop) 迷茫不知该去哪里
(We don't stop) 变成罗盘相互指引
(We don't stop) 就算跑得⽓喘吁吁
(We don't stop) We don't know how to stop, yeah (We can do it all day)
(We don't stop) 曾形单影只的我
(We don't stop) 爱上了以"我们"为名
(We don't stop) 我的身边是你
(We don't stop) 一起奔跑不息

Hey, hey
全力以赴用心 pass, hey
和我一起奔跑的你是否心潮涌起？
请给我答案当这一曲唱毕
Hey, hey
手掌温热扣在一起
万千情思奔涌填满我隐秘的心底
遇见你是我一生的幸运

当我们梦想成真 (Dream comes)
默契地融为一身 (We are)
这一切我深信不疑
早已镌刻成了碑铭

就算慢一点 (Hey)
也要与你同行 (Yeah, yeah)
看不见尽头 (Hey)
我也无所畏惧 (Yeah, yeah)
直到抵达梦想时日
I'll never let you down
奔跑不会停息

Hey, hey
纷乱思绪全都 pass, hey
累了我来做你的靠椅
我们融为一体
一起奔赴那最后的征旅
Hey, hey
你我呼吸彼此冲击
人生拼图连为一体
我们不虚此名
不是偶然而是命中注定

(We don't stop) Oh-woah, oh
(We don't stop) Ooh-woah, ooh-woah
(We don't stop) 侧耳听我说遇见你
是我一生的幸运`
  },
  {
    id: 'note-song-3', date: '2026年9月19日', dateKey: '2026-09-19', title: '恋爱ing', audioSrc: './备忘录/备忘录歌曲3.mp3',
    content: `陪你熬夜 聊天到爆肝也没关系
陪你逛街 逛成扁平足也没关系
超感谢你 让我重生 整个 O R Z
让我重新认识 L O V E
L O V E L O V E
恋爱 I N G happy I N G
心情就像是 坐上一台喷射机
恋爱 I N G 改变 I N G
改变了黄昏 黎明
有你 都心跳到不行
你是空气 但是好闻胜过了空气
你是阳光 但是却能照进半夜里
水能载舟 也能煮粥 喂饱了生命
你就是维他命 L O V E
L O V E L O V E
恋爱 I N G happy I N G
心情就像是 坐上一台喷射机
恋爱 I N G 改变 I N G
改变了黄昏 黎明
有你 都心跳到不行
未来某年某月某日某时某分某秒
某人某地某种永远的心情
不会忘记此刻 L O V E
L O V E L O V E
L O V E L O V E
恋爱 I N G happy I N G
心情就像是 坐上一台喷射机
恋爱 I N G 改变 I N G
改变了黄昏 黎明
有你 都心跳到不行
黄昏 黎明 整个都恋爱 I N G`
  }
  ,{
    id: 'memo4', date: '2026年10月21日', title: '辛拉面料理方法', audioSrc: '',
    content: `全程调大火，中间绝对不能调小火
先放水（正常吃面的碗打一碗）
水开后下面饼和调料粉
水开后一分钟打鸡蛋
再煮两分钟，出锅
出锅时切葱段`
  },
  {
    id: 'memo5', date: '2026年10月16日', title: '电影清单', audioSrc: '',
    content: `1.与王生活的男人
2.群体
3.希望
4.蜘蛛侠
5.复联五
6.奥德赛
7.生化危机（某人拒绝陪我去看kkk）`
  },
  {
    id: 'memo6', date: '2026年8月4日', title: 'Date！', audioSrc: '',
    content: `【10：00】Eternal Log 城东区 圣水洞二街 316-29
菲林人生四格
【12：00】충무로4길 3 1층 (한신빌딩)
午餐：墨西哥taco（听说很好吃）
【14：00】경기 광주시 도척면 도척윗로 278
昆池岩滑雪场
备注：提醒道勋哥带滑雪用品
【20：00】서울시 강남구 도산대로57길 7 지하1층
Aseul 清潭（出片！！！）
备注：提前两天预约餐厅；带照相设备；有酒水低消`
  },
  {
    id: 'memo7', date: '2026年7月14日', title: '首尔中餐厅', audioSrc: '',
    content: `1.任师傅 CHINESE FOOD & PUB MONG KOK
2.​​베이징덕 압구정 본점
3.캐러벨 이스트아시아 한남점 서울 용산구 독서당로 70 1층
4.까치발  서울 마포구 연남로1길 26 1층
5.태양 중화요리
6.Bao首尔 Seongsu  圣水洞二街 275-14`
  },
  {
    id: 'memo8', date: '2026年5月13日', title: '果蔬汁食谱', audioSrc: '',
    content: `1.芹菜蔬果汁⭐️：芹菜2根、黄瓜1/3根、苹果半个、柠檬1/4个、生姜2-3片、清水300ml
2.羽衣甘蓝汁⭐️⭐️⭐️⭐️⭐️：羽衣甘蓝（焯水）6片、去籽青提10颗、苹果1个、柠檬半个、清水250ml、蜂蜜一勺、冷泡茉莉花茶100ml
3.花青素果蔬汁⭐️⭐️⭐️：紫甘蓝1/4个、火龙果半个、蓝莓6-10颗、黑莓6-10颗、清水300ml
4.哈佛抗炎姜黄汁⭐️⭐️：菠萝60-110g、苹果半个、生姜2-3片、柠檬1/3个、清水300ml
5.苹果燕麦奶昔⭐️⭐️⭐️⭐️（🐺최애）：燕麦50g、苹果半个、纯牛奶1盒、清水300ml
6.番茄胡萝卜汁⭐️⭐️：番茄1个、胡萝卜半个、苹果1个、清水300ml`
  }
];
